local function run (msg , matches)
if matches[1]:lower() == "help" or matches[1] == 'مساعدة' and is_mod(msg) then
if not lang then
text = [[
Bot BY:
@lock_at_me_now
and
@THS_56
____________________
»قوائم المساعدة:

🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !mod help
⚙️》!قائمة المدراء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !lock help1
⚙️》!قائمة قفل1
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !lock help2
⚙️》قائمة قفل2
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !sudo help
⚙️》!قائمة المطورين​

🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆     
 ;)]]

elseif lang then

text = [[
Bot BY:
@lock_at_me_now
and
@THS_56
____________________
»قوائم المساعدة:

🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !mod help
⚙️》!قائمة المدراء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !lock help1
⚙️》!قائمة قفل1
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !lock help2
⚙️》قائمة قفل2
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚓ !sudo help
⚙️》!قائمة المطورين​

🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
     

  ;)]]
end
return text
end
-----------------------------------------
if matches[1]:lower() == "lock help1" or matches[1] == 'قائمة قفل1' and is_mod(msg) then
if not lang then
lock = "Group name:"..msg.to.title..[[

-------------------
 ⚙قائمة قفل1
⚓lock help1
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الروابط 🔖 لقفل الروابط 
⚙!فتح الروابط 🔖 لفتح الروابط
⚓!lock link 🔖 لقفل الروابط
⚓!unlock link لفتح الروابط
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل التاك 🔖 لقفل التاك
⚙!فتح التاك 🔖 لفتح التاك
⚓!lock tag 🔖 لقفل التاك
⚓!unlock tag 🔖 لفتح التاك
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل التعديل 🔖 لقفل التعديل في المجموعة
⚙!فتح التعديل 🔖 لفتح التعديل في المجموعة
⚓!lock edit 🔖 لقفل التعديل في المجموعة
⚓!unlock edit 🔖 لفتح التعديل في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الكلمات السيئة 🔖 لقفل الكلمات السيئة
⚙ !فتح الكلمات السيئة 🔖 لفتح الكلمات السيئة
⚓ !lock fuck 🔖 لقفل الكلمات السيئة
⚓ !unlock fuck 🔖 لفتح الكلمات السيئة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
 ⚙!قفل العريبة 🔖 لقفل اللغة العربية في المجموعة
⚙!فتح العربية 🔖 لفتح اللغة العربية في المجموعة
⚓lock arabic 🔖 لقفل اللغة العربية في المجموعة
⚓unlock arabic 🔖 لفتح اللغة العربية في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل صفحات الويب 🔖 لقفل صفحات الويب نهائياً
⚙!فتح صفحات الويب 🔖 لفتح صفحات الويب 
⚓!lock webpage 🔖 لقفل صفحات الويب نهائياً
⚓!unlock webpage 🔖 لفتح صفحات الويب
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل البوتات 🔖 لقفل البوتات في المجموعة
⚙!فتح البوات 🔖 لفتح البوتات في المجموعة
⚓!lock bots 🔖 لقفل البوتات في المجموعة
⚓!unlock bots 🔖 لفتح البوتات في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل السبام 🔖 لقفل السبام في المجموعة
⚙ !فتح السبام 🔖 لفتح لسبام في المجموعة
⚓!lock spam 🔖 لقفل السبام في المجموعة
⚓!unlock spam 🔖 لفتح السبام في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل التكرار 🔖 لقفل التكرار
⚙ !فتح التكرار 🔖 لفتح التكرار 
⚓!lock flood 🔖 لقفل التكرار 
⚓!unlock flood 🔖 لفتح التكرار
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الماركداون 🔖 لقفل الماركداون
⚙!فتح الماركداون 🔖 لفتح الماركداون
⚓lock markdown 🔖 لقفل الماركداون
⚓unlock markdown 🔖 لفتح الماركداون
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الاستدعاء 🔖 لقفل استدعاء الاشخاص
⚙!فتح الاستدعاء 🔖لفتح استدعاء الاشخاص
⚓!lock mention 🔖 لقفل الاستدعاء
⚓!unlock mention 🔖 لفتح الاستدعاء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name

elseif lang then

lock = "Group name:"..msg.to.title..[[

-------------------
 ⚙قائمة قفل1
⚓lock help1
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الروابط 🔖 لقفل الروابط 
⚙!فتح الروابط 🔖 لفتح الروابط
⚓!lock link 🔖 لقفل الروابط
⚓!unlock link لفتح الروابط
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل التاك 🔖 لقفل التاك
⚙!فتح التاك 🔖 لفتح التاك
⚓!lock tag 🔖 لقفل التاك
⚓!unlock tag 🔖 لفتح التاك
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل التعديل 🔖 لقفل التعديل في المجموعة
⚙!فتح التعديل 🔖 لفتح التعديل في المجموعة
⚓!lock edit 🔖 لقفل التعديل في المجموعة
⚓!unlock edit 🔖 لفتح التعديل في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الكلمات السيئة 🔖 لقفل الكلمات السيئة
⚙ !فتح الكلمات السيئة 🔖 لفتح الكلمات السيئة
⚓ !lock fuck 🔖 لقفل الكلمات السيئة
⚓ !unlock fuck 🔖 لفتح الكلمات السيئة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
 ⚙!قفل العريبة 🔖 لقفل اللغة العربية في المجموعة
⚙!فتح العربية 🔖 لفتح اللغة العربية في المجموعة
⚓lock arabic 🔖 لقفل اللغة العربية في المجموعة
⚓unlock arabic 🔖 لفتح اللغة العربية في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل صفحات الويب 🔖 لقفل صفحات الويب نهائياً
⚙!فتح صفحات الويب 🔖 لفتح صفحات الويب 
⚓!lock webpage 🔖 لقفل صفحات الويب نهائياً
⚓!unlock webpage 🔖 لفتح صفحات الويب
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل البوتات 🔖 لقفل البوتات في المجموعة
⚙!فتح البوات 🔖 لفتح البوتات في المجموعة
⚓!lock bots 🔖 لقفل البوتات في المجموعة
⚓!unlock bots 🔖 لفتح البوتات في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل السبام 🔖 لقفل السبام في المجموعة
⚙ !فتح السبام 🔖 لفتح لسبام في المجموعة
⚓!lock spam 🔖 لقفل السبام في المجموعة
⚓!unlock spam 🔖 لفتح السبام في المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل التكرار 🔖 لقفل التكرار
⚙ !فتح التكرار 🔖 لفتح التكرار 
⚓!lock flood 🔖 لقفل التكرار 
⚓!unlock flood 🔖 لفتح التكرار
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الماركداون 🔖 لقفل الماركداون
⚙!فتح الماركداون 🔖 لفتح الماركداون
⚓lock markdown 🔖 لقفل الماركداون
⚓unlock markdown 🔖 لفتح الماركداون
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙!قفل الاستدعاء 🔖 لقفل استدعاء الاشخاص
⚙!فتح الاستدعاء 🔖لفتح استدعاء الاشخاص
⚓!lock mention 🔖 لقفل الاستدعاء
⚓!unlock mention 🔖 لفتح الاستدعاء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
end
return lock
end
-----------------------------------------
if matches[1]:lower() == "lock help2" or matches[1] == 'قائمة قفل2' and is_mod(msg) then
if not lang then
lock2 = "Group name:"..msg.to.title..[[

-------------------
قائمة  قفل2
lock help2
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصور المتحركه 🔖 لقفل الصور المتحركه
⚙ !فتح الصور المتحركه 🔖 لفتح الصور المتحركه
⚓ !lock gif 🔖 لقفل الصور المتحركه
⚓ !unlock gif 🔖 لفتح الصور المتحركه
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصور 🔖 لقفل الصور
⚙ !فتح الصور 🔖 لفتح الصور
⚓ !lock photo 🔖 لقفل الصور
⚓ !unlock photo 🔖 لفتح الصور
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الملفات 🔖 لمنع الملفات في المجموعة
⚙ !فتح الملفات 🔖 لفتح الملفات في المجموعة
⚓ !lock document 🔖 لقفل الملفات 
⚓ !unlock document 🔖 لفتح الملفات 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الملصقات 🔖 لقفل الملصقات
⚙ !فتح الملصقات 🔖 لفتح الملصقات
⚓ !lock sticker 🔖 لقفل الملصقات 
⚓ !unlock sticker 🔖 لفتح الملصقات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الفيديو 🔖 لقفل الفيديوهات​ في المجموعة 
⚙ !فتح الفيديو 🔖 لفتح الفيديوهات في المجموعة
⚓ !lock video 🔖 لقفل الفيديوهات​ في المجموعة
⚓ !unlock video 🔖 لفتح الفيديوهات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل النص 🔖 لقفل الدردشة
⚙ !فتح النص 🔖 لفتح الدردشة
⚓ !lock text 🔖 لقفل النص 
⚓ !unlock text 🔖 لفتح النص 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل اعادة التوجيه 🔖 لقفل اعاده التوجيه الى المجموعة
⚙ فتح اعادة التوجيه 🔖 لفتح اعاده توجيه الى المجموعة 
⚓  !lock forward 🔖 الله قفل اعاده التوجيه الى المجموعة
⚓  !unlock forward 🔖 لفتح اعاده توجيه الى المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصوت 🔖 لقفل البصمات
⚙ !فتح الصوت 🔖 لفتح البصمات
⚓  !lock voice 🔖 لقفل البصمات
⚓ !unlock voice 🔖 لفتح البصمات 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل جهات الاتصال 🔖 لقفل ارسال جهات الاتصال
⚙ !فتح جهات الاتصال 🔖 لفتح ارسال جهات الاتصال
⚓  !lock contact 🔖 لقفل جهات الاتصال
⚓ !unlock contact 🔖 لفتح جهات الاتصال
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الكل 🔖 لقفل كل شيئ
⚙ !فتح الكل 🔖 لفتح كل شيئ
⚓ !lock all 🔖 لقفل كل شيئ
⚓ !unlock all 🔖 لفتح كل شيئ
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل انلاين 🔖لقفل كيبورد الانلاين
⚙ !فتح انلاين 🔖لفتح كيبورد الانلاين
⚓ !lock inline 🔖 لقفل كيبورد الانلاين
⚓ !unlock inline 🔖 لفتح كيبورد الانلاين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[

-------------------
قائمة  قفل2
lock help2
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصور المتحركه 🔖 لقفل الصور المتحركه
⚙ !فتح الصور المتحركه 🔖 لفتح الصور المتحركه
⚓ !lock gif 🔖 لقفل الصور المتحركه
⚓ !unlock gif 🔖 لفتح الصور المتحركه
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصور 🔖 لقفل الصور
⚙ !فتح الصور 🔖 لفتح الصور
⚓ !lock photo 🔖 لقفل الصور
⚓ !unlock photo 🔖 لفتح الصور
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الملفات 🔖 لمنع الملفات في المجموعة
⚙ !فتح الملفات 🔖 لفتح الملفات في المجموعة
⚓ !lock document 🔖 لقفل الملفات 
⚓ !unlock document 🔖 لفتح الملفات 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الملصقات 🔖 لقفل الملصقات
⚙ !فتح الملصقات 🔖 لفتح الملصقات
⚓ !lock sticker 🔖 لقفل الملصقات 
⚓ !unlock sticker 🔖 لفتح الملصقات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الفيديو 🔖 لقفل الفيديوهات​ في المجموعة 
⚙ !فتح الفيديو 🔖 لفتح الفيديوهات في المجموعة
⚓ !lock video 🔖 لقفل الفيديوهات​ في المجموعة
⚓ !unlock video 🔖 لفتح الفيديوهات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل النص 🔖 لقفل الدردشة
⚙ !فتح النص 🔖 لفتح الدردشة
⚓ !lock text 🔖 لقفل النص 
⚓ !unlock text 🔖 لفتح النص 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل اعادة التوجيه 🔖 لقفل اعاده التوجيه الى المجموعة
⚙ فتح اعادة التوجيه 🔖 لفتح اعاده توجيه الى المجموعة 
⚓  !lock forward 🔖 لقفل اعاده التوجيه الى المجموعة
⚓  !unlock forward 🔖 لفتح اعاده توجيه الى المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الصوت 🔖 لقفل البصمات
⚙ !فتح الصوت 🔖 لفتح البصمات
⚓  !lock voice 🔖 لقفل البصمات
⚓ !unlock voice 🔖 لفتح البصمات 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل جهات الاتصال 🔖 لقفل ارسال جهات الاتصال
⚙ !فتح جهات الاتصال 🔖 لفتح ارسال جهات الاتصال
⚓  !lock contact 🔖 لقفل جهات الاتصال
⚓ !unlock contact 🔖 لفتح جهات الاتصال
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل الكل 🔖 لقفل كل شيئ
⚙ !فتح الكل 🔖 لفتح كل شيئ
⚓ !lock all 🔖 لقفل كل شيئ
⚓ !unlock all 🔖 لفتح كل شيئ
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚙ !قفل انلاين 🔖لقفل كيبورد الانلاين
⚙ !فتح انلاين 🔖لفتح كيبورد الانلاين
⚓ !lock inline 🔖 لقفل كيبورد الانلاين
⚓ !unlock inline 🔖 لفتح كيبورد الانلاين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "mod help" or matches[1] == "قائمة المدراء" and is_mod(msg) then
if not lang then
helpfun = "Group name:"..msg.to.title..[[

-------------------
قائمة المدراء
mod help!
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتعيين مدير للمجموعه 🌐
✩》 !setowner [username|id|reply] 
 🎇 !تعيين مدير | بالمعرف | ايدي |بالرد
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف مدير من المجموعه 🌐
✩》 !remowner [username|id|reply] 
 🎇 !ازاله مدیر  【بالمعرف | آدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لرفع مشرف في المجموعة 🌐
✩》 !promote [username|id|reply] 
🎇 !ترقيه 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف مشرف في المجموعة 🌐
✩》 !demote [username|id|reply] 
🎇 !خفض 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
 لتعيين تكرار المجموعة 🌐
✩》 !setflood [1-50]
🎇 !تعيين تكرار 【50-1】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لكتم عضو 🌐
✩》 !silent [username|id|reply] 
🎇 !كتم 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لالغاء الكتم عن العضو 🌐
✩》 !unsilent [username|id|reply] 
🎇 !الغاء الكتم 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لطرد عضو
✩》 !kick [username|id|reply] 
🎇 !طرد 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحضر عضو 🌐
✩》 !ban [username|id|reply] 
🎇 !حضر 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لرفع الحضر 🌐
✩》 !unban [username|id|reply] 
🎇 !الغاء الحضر 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لعرض معلومات عضو 🌐
✩》 !res [username]
🎇 !معلومات 【بالمعرف】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار ايدي شخص
✩》 !id [reply]
🎇 !ايدي 【بالرد】 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار تفاصيل العضو
✩》 !whois [id]
🎇 !من هوه 【ايدي】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لوضع وصف ، قوانين الخ....🌐
✩》 !set[rules | name | photo | link | about ]
🎇 !تعيين 【قوانين | صوره | رابط | وصف 】
 🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف وصف ، قوانين الخ....🌐
✩》 !clean [bans | mods | bots | rules | about | silentlist | filterlist | welcome]   
🎇 !تنضيف 【 قائمة المحضورين| المشرفين| البوتات | القوانين | الوصف | قائمة المكتومين |  قائمه الكلمات | الترحيب 】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضافة كلمه 🌐
✩》 !filter [word]
🎇 !كلمه【الكلمة+】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف كلمة🌐
✩》 !unfilter [word]
🎇 !ازاله كلمه 【الكلمه-】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتثبيت رسالة في المجموعة 🌐
✩》 !pin [reply]
🎇 !تثبيت【بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف التثبيت 🌐
✩》 !unpin [reply]
🎇 !الغاء تثبيت【بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتفعيل ، الغاء تفعيل الترحيب في المجموعة 🌐
✩》 !welcome enable/disable
🎇 !ترحيب  [تفعيل - تعطيل]
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار الاعدادات 🌐
✩》 !settings
🎇 !الاعدادات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمه المكتومين🌐
✩》 !silentlist
🎇 !قائمة المكتومين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة الكلمات🌐
✩》 !filterlist
🎇 !قائمه الكلمات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المحضورين 🌐
✩》 !banlist
🎇 !قائمة المحضورين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المدراء🌐
✩》 !ownerlist
🎇 قائمة المدراء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المشرفين 🌐
✩》 !modlist 
🎇 !قائمه المشرفين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قوانين المجموعة 🌐
✩》 !rules
🎇 !القوانين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار وصف المجموعة 🌐
✩》 !about
🎇 !الوصف
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار ايديك 🌐
✩》 !id
🎇 !ايدي
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
✩》me 
 📅لاضهار ترتيبك بالمجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار معلومات المجموعة 🌐
✩》 !gpinfo
🎇 !معلومات المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار رابط المجموعة 🌐
✩》 !link
🎇 !الرابط 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتعيين ترحيب المجموعة 🌐
✩》 !setwelcome [text]
🎇 !تعيين ترحيب (نص الترحيب)
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, helpfun, 1, 'md')
else

helpfun = "Group name:"..msg.to.title..[[

-------------------
قائمة المدراء
mod help!
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتعيين مدير للمجموعه 🌐
✩》 !setowner [username|id|reply] 
 🎇 !تعيين مدير | بالمعرف | ايدي |بالرد
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف مدير من المجموعه 🌐
✩》 !remowner [username|id|reply] 
 🎇 !ازاله مدیر  【بالمعرف | آدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لرفع مشرف في المجموعة 🌐
✩》 !promote [username|id|reply] 
🎇 !ترقيه 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف مشرف في المجموعة 🌐
✩》 !demote [username|id|reply] 
🎇 !خفض 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
 لتعيين تكرار المجموعة 🌐
✩》 !setflood [1-50]
🎇 !تعيين تكرار 【50-1】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لكتم عضو 🌐
✩》 !silent [username|id|reply] 
🎇 !كتم 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لالغاء الكتم عن العضو 🌐
✩》 !unsilent [username|id|reply] 
🎇 !الغاء الكتم 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لطرد عضو
✩》 !kick [username|id|reply] 
🎇 !طرد 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحضر عضو 🌐
✩》 !ban [username|id|reply] 
🎇 !حضر 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لرفع الحضر 🌐
✩》 !unban [username|id|reply] 
🎇 !الغاء الحضر 【بالمعرف | آیدي | بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لعرض معلومات عضو 🌐
✩》 !res [username]
🎇 !معلومات 【بالمعرف】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار ايدي شخص
✩》 !id [reply]
🎇 !ايدي 【بالرد】 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار تفاصيل العضو
✩》 !whois [id]
🎇 !من هوه 【ايدي】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لوضع وصف ، قوانين الخ....🌐
✩》 !set[rules | name | photo | link | about ]
🎇 !تعيين 【قوانين | صوره | رابط | وصف 】
 🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف وصف ، قوانين الخ....🌐
✩》 !clean [bans | mods | bots | rules | about | silentlist | filterlist | welcome]   
🎇 !تنضيف 【 قائمة المحضورين| المشرفين| البوتات | القوانين | الوصف | قائمة المكتومين |  قائمه الكلمات | الترحيب 】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضافة كلمه 🌐
✩》 !filter [word]
🎇 !كلمه【الكلمة+】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف كلمة🌐
✩》 !unfilter [word]
🎇 !ازاله كلمه 【الكلمه-】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتثبيت رسالة في المجموعة 🌐
✩》 !pin [reply]
🎇 !تثبيت【بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لحذف التثبيت 🌐
✩》 !unpin [reply]
🎇 !الغاء تثبيت【بالرد】
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتفعيل ، الغاء تفعيل الترحيب في المجموعة 🌐
✩》 !welcome enable/disable
🎇 !ترحيب  [تفعيل - تعطيل]
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار الاعدادات 🌐
✩》 !settings
🎇 !الاعدادات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمه المكتومين🌐
✩》 !silentlist
🎇 !قائمة المكتومين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة الكلمات🌐
✩》 !filterlist
🎇 !قائمه الكلمات
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المحضورين 🌐
✩》 !banlist
🎇 !قائمة المحضورين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المدراء🌐
✩》 !ownerlist
🎇 قائمة المدراء
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قائمة المشرفين 🌐
✩》 !modlist 
🎇 !قائمه المشرفين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار قوانين المجموعة 🌐
✩》 !rules
🎇 !القوانين
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار وصف المجموعة 🌐
✩》 !about
🎇 !الوصف
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار ايديك 🌐
✩》 !id
🎇 !ايدي
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
✩》me 
 📅لاضهار ترتيبك بالمجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار معلومات المجموعة 🌐
✩》 !gpinfo
🎇 !معلومات المجموعة
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لاضهار رابط المجموعة 🌐
✩》 !link
🎇 !الرابط 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
لتعيين ترحيب المجموعة 🌐
✩》 !setwelcome [text]
🎇 !تعيين ترحيب (نص الترحيب)
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, helpfun, 1, 'md')
end
end
-----------------------------------------
if matches[1] == "sudo help" or  matches[1] == "قائمة المطورين" and is_mod(msg) then
if not lang then
text = [[

⚜️ !visudo [username|id|reply]
✰》اضافة مطور في البوت🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
 ⚜️ !desudo [username|id|reply]
✰》لحذف مطور من البوت 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !sudolist 
✰》لاضهار قائمه المطورين 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !adminprom [username|id|reply]
✰》 لاضافه ادمن اساسي في البوت🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !admindem [username|id|reply]
✰》 لحذف ادمن اساسي في البوت🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !adminlist 
✰》 لاضهار قائمة الادمنية الاساسين 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !leave 
✰》لاخراج البوت من المجموعه 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !autoleave [disable/enable]
 ✰》 لاخراج البوت من المجموعه تلقائيا🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !creategroup [text]
✰》لاصنع مجموعة عاديه 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !createsuper [text]
✰》 لصنع مجموعة سوبر 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !tosuper 
✰》 لتحويل المجموعه الى خارقة🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !chats
✰》قائمه مديرين البوت 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !join [id]
لدخول مجموعة 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !rem [id]
✰》 لتعطيل البوت بمجموعة معينه🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !import [link]
✰》 لدخول البوت مجموعه بواسطه الرابط🔌 
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !setbotname [text]
✰》 تغییر اسم البوت 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !setbotusername [text]
✰》 تغییر معرف البوت🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !delbotusername 
✰》 حذف معرف البوت🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !markread [off/on]
✰》لتعطيل او تفعيل الماركداون
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !broadcast [text]
✰》 ارسل رسالة الى جميع المجموعات🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !bc [text] [gpid]
✰》 ارسال پیام مورد نظر به گروه خاص
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !sendfile [cd] [file]
✰》 لارسال ملف معين 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !sendplug [plug]
✰》 لارسال مفل من ملفات ال plugins 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !save [plugin name] [reply]
✰》 لحفض ملف 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !savefile [address/filename] [reply]
✰》 لحفض ملف في مكان معين 🔌
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
⚜️ !clear cache
📜لحذف الملفات المؤقته في ملف
✰》 .telegram-cli/data
🔅🔺🔻🔺🔻🔺🔻🔺🔻🔆
!set expire [Number Of Days]
لتعيين وقت للبوت أن يبقى في المجموعة🎇
---------------ⁿ
 ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
else

text = [[
اهنما سودو🔛sudo help!🔶

!visudo [username|id|reply]
Add Sudo

!desudo [username|id|reply]
Demote Sudo

!sudolist 
Sudo(s) list

!adminprom [username|id|reply]
Add admin for bot

!admindem [username|id|reply]
Demote bot admin

!adminlist 
Admin(s) list

!leave 
Leave current group

!autoleave [disable/enable]
Automatically leaves group

!creategroup [text]
Create normal group

!createsuper [text]
Create supergroup

!tosuper 
Convert to supergroup

!join [id]
Adds you to the group

!rem [id]
Remove a group from Database

!import [link]
Bot joins via link

!setbotname [text]
Change bot's name

!setbotusername [text]
Change bot's username

!delbotusername 
Delete bot's username

!markread [off/on]
Second mark

!broadcast [text]
Send message to all added groups

!bc [text] [gpid]
Send message to a specific group

!del [Reply]
Remove message Person you are

!clear cache
Clear All Cache Of .telegram-cli/data

!check
Stated Expiration Date

!check [GroupID]
Stated Expiration Date Of Specific Group

!set expire [Number Of Days]
Set Expire Time For Group

!leave [GroupID]
Leave Bot From Specific Group

ارسل كلمه *مساعدة* لمعرفة قوائم المساعده!
DEV: @lock_at_me_now & @THS_56
 MSG BY :]]..msg.from.first_name
tdcli.sendMessage(msg.chat_id_, 0, 1, text, 1, 'md')
end
end
end


return {
patterns ={
"^([Hh]elp)$",
"^(lock help1)$",
"^(lock help2)$",
"^(mod help)$",
"^(sudo help)$",
"^(مساعدة)$",
"^(قائمة قفل1)$",
"^(قائمة قفل2)$",
"^(قائمة المدراء)$",
"^(قائمة المطورين)$"

}, 
run =run
}
